; domain
(define (domain the_game)
    (:requirements :strips :typing :fluents :negative-preconditions :disjunctive-preconditions :conditional-effects)

    (:types 
        pile card - object
    )

    (:predicates
        (ascending_pile ?p - pile)
        (descending_pile ?p - pile)
        (card_in_hand ?c - card)
        (top_pile_card ?p - pile ?c - card)
        (next_card_in_deck ?c1 - card ?c2 - card)  ; Simulates list order in drawing pile
        (top_deck_card ?c - card)
        (is_drawing)
        (is_bottom_card ?c - card)
        (deck_empty)
    )

    (:functions
        (value ?c - card)
        (n_card_in_hand) 
    )

    (:action play_card
        :parameters (?c - card ?p - pile ?c_top - card)
        :precondition (and
            (card_in_hand ?c) 
            (top_pile_card ?p ?c_top) 
            (not (is_drawing))
            (or 
                (and (ascending_pile ?p) (> (value ?c) (value ?c_top)))
                (and (descending_pile ?p) (< (value ?c) (value ?c_top)))
                (and (ascending_pile ?p) (= (value ?c) (- (value ?c_top) 10)))
                (and (descending_pile ?p) (= (value ?c) (+ (value ?c_top) 10)))
            )
        )
        :effect (and
            (not (card_in_hand ?c))
            (top_pile_card ?p ?c)
            (not (top_pile_card ?p ?c_top))
            (decrease (n_card_in_hand) 1)

        )
    )

    (:action draw_card
        :parameters (?c1 - card ?c2 - card)
        :precondition (and
            (top_deck_card ?c1)
            (next_card_in_deck ?c1 ?c2)
            (<= (n_card_in_hand) 6)
            (or 
                (is_drawing)
                (<= (n_card_in_hand) 5)
            )
        )
        :effect (and
            (not (top_deck_card ?c1))
            (top_deck_card ?c2)
            (card_in_hand ?c1)
            (increase (n_card_in_hand) 1)
            (is_drawing)
        )
    )
    
    (:action stop_drawing
        :parameters ()
        :precondition (and 
            (= (n_card_in_hand) 7)
            (is_drawing)
        )
        :effect (not (is_drawing))
    )

    (:action draw_final_card
        :parameters (?c1 - card)
        :precondition (and
            (top_deck_card ?c1)
            (is_bottom_card ?c1)
        )
        :effect (and
            (not (top_deck_card ?c1))
            (card_in_hand ?c1)
            (increase (n_card_in_hand) 1)
            (not (is_drawing))
            (deck_empty)
        )
    )

)

; problem
(define (problem problem1)
    (:domain the_game)
    (:objects
        pile0 pile1 - pile
        c5 c70 c52 c74 c17 c4 c89 c20 c50 c19 c27 c30 c10 c3 c28 - card
        c_start_0 c_start_1 - card
    )
    (:init
        (ascending_pile pile0)
        (descending_pile pile1)
        (top_pile_card pile0 c_start_0)
        (top_pile_card pile1 c_start_1)
        (top_deck_card c5)
        (next_card_in_deck c5 c70)
        (next_card_in_deck c70 c52)
        (next_card_in_deck c52 c74)
        (next_card_in_deck c74 c17)
        (next_card_in_deck c17 c4)
        (next_card_in_deck c4 c89)
        (next_card_in_deck c89 c20)
        (next_card_in_deck c20 c50)
        (next_card_in_deck c50 c19)
        (next_card_in_deck c19 c27)
        (next_card_in_deck c27 c30)
        (next_card_in_deck c30 c10)
        (next_card_in_deck c10 c3)
        (next_card_in_deck c3 c28)
        (is_bottom_card c28)
        (= (n_card_in_hand) 0)
        (= (value c_start_0) 1)
        (= (value c_start_1) 100)
        (= (value c5) 5)
        (= (value c70) 70)
        (= (value c52) 52)
        (= (value c74) 74)
        (= (value c17) 17)
        (= (value c4) 4)
        (= (value c89) 89)
        (= (value c20) 20)
        (= (value c50) 50)
        (= (value c19) 19)
        (= (value c27) 27)
        (= (value c30) 30)
        (= (value c10) 10)
        (= (value c3) 3)
        (= (value c28) 28)
    )
    (:goal
        (and
            (deck_empty)
            (= (n_card_in_hand) 0)
        )
    )
)

; plan
1. (draw_card c5 c70)
   deleted: (top_deck_card c5)
   added: (top_deck_card c70) (card_in_hand c5) (is_drawing)
   changed: (n_card_in_hand) from 0 to 1
   goals met: 0 of 2
2. (draw_card c70 c52)
   deleted: (top_deck_card c70)
   added: (top_deck_card c52) (card_in_hand c70)
   changed: (n_card_in_hand) from 1 to 2
   goals met: 0 of 2
3. (draw_card c52 c74)
   deleted: (top_deck_card c52)
   added: (top_deck_card c74) (card_in_hand c52)
   changed: (n_card_in_hand) from 2 to 3
   goals met: 0 of 2
4. (draw_card c74 c17)
   deleted: (top_deck_card c74)
   added: (top_deck_card c17) (card_in_hand c74)
   changed: (n_card_in_hand) from 3 to 4
   goals met: 0 of 2
5. (draw_card c17 c4)
   deleted: (top_deck_card c17)
   added: (top_deck_card c4) (card_in_hand c17)
   changed: (n_card_in_hand) from 4 to 5
   goals met: 0 of 2
6. (draw_card c4 c89)
   deleted: (top_deck_card c4)
   added: (top_deck_card c89) (card_in_hand c4)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
7. (draw_card c89 c20)
   deleted: (top_deck_card c89)
   added: (top_deck_card c20) (card_in_hand c89)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
8. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
9. (play_card c17 pile0 c_start_0)
   deleted: (card_in_hand c17) (top_pile_card pile0 c_start_0)
   added: (top_pile_card pile0 c17)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
10. (play_card c89 pile1 c_start_1)
   deleted: (card_in_hand c89) (top_pile_card pile1 c_start_1)
   added: (top_pile_card pile1 c89)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
11. (play_card c70 pile1 c89)
   deleted: (card_in_hand c70) (top_pile_card pile1 c89)
   added: (top_pile_card pile1 c70)
   changed: (n_card_in_hand) from 5 to 4
   goals met: 0 of 2
12. (play_card c52 pile1 c70)
   deleted: (card_in_hand c52) (top_pile_card pile1 c70)
   added: (top_pile_card pile1 c52)
   changed: (n_card_in_hand) from 4 to 3
   goals met: 0 of 2
13. (play_card c5 pile1 c52)
   deleted: (card_in_hand c5) (top_pile_card pile1 c52)
   added: (top_pile_card pile1 c5)
   changed: (n_card_in_hand) from 3 to 2
   goals met: 0 of 2
14. (play_card c4 pile1 c5)
   deleted: (card_in_hand c4) (top_pile_card pile1 c5)
   added: (top_pile_card pile1 c4)
   changed: (n_card_in_hand) from 2 to 1
   goals met: 0 of 2
15. (draw_card c20 c50)
   deleted: (top_deck_card c20)
   added: (top_deck_card c50) (card_in_hand c20) (is_drawing)
   changed: (n_card_in_hand) from 1 to 2
   goals met: 0 of 2
16. (draw_card c50 c19)
   deleted: (top_deck_card c50)
   added: (top_deck_card c19) (card_in_hand c50)
   changed: (n_card_in_hand) from 2 to 3
   goals met: 0 of 2
17. (draw_card c19 c27)
   deleted: (top_deck_card c19)
   added: (top_deck_card c27) (card_in_hand c19)
   changed: (n_card_in_hand) from 3 to 4
   goals met: 0 of 2
18. (draw_card c27 c30)
   deleted: (top_deck_card c27)
   added: (top_deck_card c30) (card_in_hand c27)
   changed: (n_card_in_hand) from 4 to 5
   goals met: 0 of 2
19. (draw_card c30 c10)
   deleted: (top_deck_card c30)
   added: (top_deck_card c10) (card_in_hand c30)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
20. (draw_card c10 c3)
   deleted: (top_deck_card c10)
   added: (top_deck_card c3) (card_in_hand c10)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
21. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
22. (play_card c20 pile0 c17)
   deleted: (card_in_hand c20) (top_pile_card pile0 c17)
   added: (top_pile_card pile0 c20)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
23. (play_card c10 pile0 c20)
   deleted: (card_in_hand c10) (top_pile_card pile0 c20)
   added: (top_pile_card pile0 c10)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
24. (play_card c19 pile0 c10)
   deleted: (card_in_hand c19) (top_pile_card pile0 c10)
   added: (top_pile_card pile0 c19)
   changed: (n_card_in_hand) from 5 to 4
   goals met: 0 of 2
25. (play_card c27 pile0 c19)
   deleted: (card_in_hand c27) (top_pile_card pile0 c19)
   added: (top_pile_card pile0 c27)
   changed: (n_card_in_hand) from 4 to 3
   goals met: 0 of 2
26. (draw_card c3 c28)
   deleted: (top_deck_card c3)
   added: (top_deck_card c28) (card_in_hand c3) (is_drawing)
   changed: (n_card_in_hand) from 3 to 4
   goals met: 0 of 2
27. (draw_final_card c28)
   deleted: (top_deck_card c28) (is_drawing)
   added: (card_in_hand c28) (deck_empty)
   changed: (n_card_in_hand) from 4 to 5
   goals met: 1 of 2
28. (play_card c3 pile1 c4)
   deleted: (card_in_hand c3) (top_pile_card pile1 c4)
   added: (top_pile_card pile1 c3)
   changed: (n_card_in_hand) from 5 to 4
   goals met: 1 of 2
29. (play_card c28 pile0 c27)
   deleted: (card_in_hand c28) (top_pile_card pile0 c27)
   added: (top_pile_card pile0 c28)
   changed: (n_card_in_hand) from 4 to 3
   goals met: 1 of 2
30. (play_card c30 pile0 c28)
   deleted: (card_in_hand c30) (top_pile_card pile0 c28)
   added: (top_pile_card pile0 c30)
   changed: (n_card_in_hand) from 3 to 2
   goals met: 1 of 2
31. (play_card c50 pile0 c30)
   deleted: (card_in_hand c50) (top_pile_card pile0 c30)
   added: (top_pile_card pile0 c50)
   changed: (n_card_in_hand) from 2 to 1
   goals met: 1 of 2
32. (play_card c74 pile0 c50)
   deleted: (card_in_hand c74) (top_pile_card pile0 c50)
   added: (top_pile_card pile0 c74)
   changed: (n_card_in_hand) from 1 to 0
   goals met: 2 of 2
